filip9411/STM32_L476RG_software/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define SWITCH_Pin GPIO_PIN_1
#define SWITCH_GPIO_Port GPIOC
#define UART2_TX_Debug_Pin GPIO_PIN_2
#define UART2_TX_Debug_GPIO_Port GPIOA
#define UART2_RX_Debug_Pin GPIO_PIN_3
#define UART2_RX_Debug_GPIO_Port GPIOA
#define LTC3109_PGOOD_Pin GPIO_PIN_4
#define LTC3109_PGOOD_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define RE_inv_Pin GPIO_PIN_13
#define RE_inv_GPIO_Port GPIOB
#define LTC3128_PGOOD_Pin GPIO_PIN_14
#define LTC3128_PGOOD_GPIO_Port GPIOB
#define LTC3105_PGOOD_Pin GPIO_PIN_9
#define LTC3105_PGOOD_GPIO_Port GPIOC
#define UART_TX_Trans_Pin GPIO_PIN_9
#define UART_TX_Trans_GPIO_Port GPIOA
#define UART_RX_Trans_Pin GPIO_PIN_10
#define UART_RX_Trans_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define DE_Pin GPIO_PIN_5
#define DE_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
